app/controllers/comments_controller.rb

def create
    @movie = Movie.find(params[:movie_id])
    @comment = @movie.comments.create(comment_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 10]]
INSERT INTO "comments" ("commenter", "body", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "gfsfgdf"], ["body", "dfgdfgde"], ["movie_id", 10], ["created_at", "2015-06-18 19:12:40.784976"], ["updated_at", "2015-06-18 19:12:40.784976"]]

def destroy
  @movie = Movie.find(params[:movie_id])
  @comment = @movie.comments.find(params[:id])
  @comment.destroy
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 10]]
SELECT  "comments".* FROM "comments" WHERE "comments"."movie_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["movie_id", 10], ["id", 27]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 27]]