app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title like '%%')
---
  def index
    @movies = Movie.search(params[:search])

INSERT INTO "movies" ("title", "genre", "descp", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Game of thrones"], ["genre", "Action"], ["descp", "hsfhstrh"], ["created_at", "2015-06-16 19:56:52.784772"], ["updated_at", "2015-06-16 19:56:52.784772"]]
---
  def create
    @movie = Movie.new(movie_params)

    if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "movies" SET "descp" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["descp", "ghkghkghkwqrqwer"], ["updated_at", "2015-06-16 22:04:51.725569"], ["id", 5]]
---
  def update
    @movie = Movie.find(params[:id])

    if @movie.update(movie_params)